[
    {
        "weekNumber": 1,
        "babyTipText": "Although conception hasn't happened yet, Week 1 marks the start of your pregnancy based on your last menstrual period. At this point, there is no baby yet—your body is preparing for ovulation.",
        "momTipText": "You may not feel pregnant, but your body is beginning the process. Hormones like estrogen and progesterone begin to fluctuate, preparing the uterus for a possible embryo."
    },
    {
        "weekNumber": 2,
        "babyTipText": "This is the week ovulation typically occurs. The egg, released from the ovary, travels down the fallopian tube, where it may meet sperm and become fertilized. The fertilized egg will begin dividing if conception occurs.",
        "momTipText": "You're at the most fertile point in your cycle. Your body releases luteinizing hormone (LH), which triggers ovulation. You may notice an increase in cervical mucus and a slight rise in body temperature."
    },
    {
        "weekNumber": 3,
        "babyTipText": "Fertilization has occurred! The single-celled zygote begins rapidly dividing and becomes a blastocyst as it journeys through the fallopian tube toward the uterus. By the end of the week, it may implant in the uterine wall.",
        "momTipText": "Although you won't notice any outward symptoms, incredible changes are underway. Your body produces more progesterone to maintain the uterine lining. Some women may experience light spotting during implantation."
    },
    {
        "weekNumber": 4,
        "quote": "I'm currently the size of a poppy seed",
        "imageUri": "https://img.icons8.com/material-two-tone/24/lentil.png",
        "babyImageUri": "Month1",
        "babyHeightInCentimeters": 0.2,
        "babyWeightInGrams": 0.002,
        "babyTipText": "The blastocyst has implanted in the uterine wall and is now called an embryo. It is forming two layers: the epiblast and the hypoblast, which will eventually give rise to the baby's organs.",
        "momTipText": "You might begin to suspect you're pregnant. Some early signs include mild cramping, breast tenderness, mood swings, or nausea. A missed period is the most noticeable sign. The placenta begins to develop."
    },
    {
        "weekNumber": 5,
        "quote": "I'm currently the size of a sesame seed",
        "imageUri": "https://img.icons8.com/plumpy/48/black-sesame-seeds.png",
        "babyImageUri": "Month1",
        "babyHeightInCentimeters": 0.3,
        "babyWeightInGrams": 0.004,
        "babyTipText": "At this stage, your baby is still very small, about the size of a sesame seed. The embryo now consists of three layers: the ectoderm (which will form the nervous system, skin, and hair), the mesoderm (which will form the heart and muscles), and the endoderm (which will form the digestive system and lungs).",
        "momTipText": "You may experience early pregnancy symptoms like morning sickness, fatigue, frequent urination, and mood swings due to hormonal shifts. Your body is working hard to nurture the developing embryo."
    },
    {
        "weekNumber": 6,
        "quote": "I'm currently the size of a lentil seed",
        "imageUri": "https://img.icons8.com/plasticine/100/lentil.png",
        "babyImageUri": "Month1",
        "babyHeightInCentimeters": 0.5,
        "babyWeightInGrams": 0.01,
        "babyTipText": "Your baby is about the size of a lentil and continues to grow rapidly. By now, the heart has begun to form and is beating, though the beats may not yet be heard on an ultrasound. The brain and spinal cord start developing.",
        "momTipText": "This week is when many women start experiencing the typical pregnancy symptoms, such as morning sickness, fatigue, and increased urination. You may also feel more emotional or sensitive than usual."
    },
    {
        "weekNumber": 7,
        "quote": "I'm currently the size of a blueberry",
        "imageUri": "https://img.icons8.com/color/48/blueberry.png",
        "babyImageUri": "Month1",
        "babyHeightInCentimeters": 1.0,
        "babyWeightInGrams": 0.02,
        "babyTipText": "Your baby is now about the size of a blueberry. The brain, heart, and other major organs are growing rapidly. Tiny arms and legs are becoming more defined, and the embryo is starting to look more like a human.",
        "momTipText": "You may notice your symptoms intensifying, especially the fatigue, nausea, and breast tenderness. As your body prepares for the baby's rapid growth in the coming weeks, your uterus is expanding."
    },
    {
        "weekNumber": 8,
        "quote": "I'm currently the size of a raspberry",
        "imageUri": "https://img.icons8.com/arcade/64/raspberry.png",
        "babyImageUri": "Month2",
        "babyHeightInCentimeters": 1.6,
        "babyWeightInGrams": 1,
        "babyTipText": "Your baby is now about the size of a raspberry. All the major organs and systems are in place and continuing to develop. The arms and legs are more distinguishable, and the facial features are forming.",
        "momTipText": "At this stage, you might begin to show a slight baby bump as your uterus grows and expands. Hormonal changes are continuing to affect your body, leading to physical changes like breast enlargement."
    },
    {
        "weekNumber": 9,
        "quote": "I'm currently the size of a grape",
        "imageUri": "https://img.icons8.com/external-line-colors-royyan-wijaya/64/external-eat-heiyo-food-collections-line-colors-royyan-wijaya-16.png",
        "babyImageUri": "Month2",
        "babyHeightInCentimeters": 2.3,
        "babyWeightInGrams": 2,
        "babyTipText": "Your baby is about the size of a grape and is rapidly growing. The arms and legs have become more defined, and the fingers and toes are starting to take shape, though they are still webbed.",
        "momTipText": "This week, your body is going through significant changes. You might notice that your morning sickness is still present, and you may feel more fatigued as your body uses a lot of energy for baby's development."
    },
    {
        "weekNumber": 10,
        "quote": "I'm currently the size of a date",
        "imageUri": "https://img.icons8.com/color/48/date-fruit.png",
        "babyImageUri": "Month2",
        "babyHeightInCentimeters": 3.1,
        "babyWeightInGrams": 4,
        "babyTipText": "At this stage, your baby is about the size of a date. The body is now growing faster than the head, and the neck is starting to develop, elongating the head. The baby's arms and legs are more developed.",
        "momTipText": "You may still experience morning sickness, although it could start to subside soon for some women. As your pregnancy progresses, your body's blood volume is increasing, which can make you feel warmer."
    },
    {
        "weekNumber": 11,
        "quote": "I'm currently the size of a lime",
        "imageUri": "https://img.icons8.com/color/96/lime.png",
        "babyImageUri": "Month2",
        "babyHeightInCentimeters": 4.1,
        "babyWeightInGrams": 7,
        "babyTipText": "Your baby is now about the size of a lime, and most of its major organs are fully formed. The baby is starting to look more human, with well-defined fingers and toes. The external genitalia are developing.",
        "momTipText": "Your pregnancy is becoming more noticeable as your uterus expands and your body continues to change. Morning sickness might be easing off for some women, but fatigue and mood swings may persist."
    },
    {
        "weekNumber": 12,
        "quote": "I'm currently the size of a plum",
        "imageUri": "https://img.icons8.com/cotton/64/plum--v1.png",
        "babyImageUri": "Month3",
        "babyHeightInCentimeters": 5.4,
        "babyWeightInGrams": 14,
        "babyTipText": "At 12 weeks, your baby is about the size of a plum. Most of the major organs and systems are fully formed, though they will continue to mature. The baby's body is now more proportional.",
        "momTipText": "By week 12, you are officially in the second trimester, which is often referred to as the “honeymoon” period of pregnancy due to a reduction in morning sickness and fatigue."
    },
    {
        "weekNumber": 13,
        "quote": "I'm currently the size of a kiwi",
        "imageUri": "https://img.icons8.com/external-smashingstocks-flat-smashing-stocks/66/external-Kiwi-fruit-smashingstocks-flat-smashing-stocks.png",
        "babyImageUri": "Month3",
        "babyHeightInCentimeters": 7.4,
        "babyWeightInGrams": 23,
        "babyTipText": "At week 13, your baby is about the size of a kiwi. The baby's facial features are becoming more distinct, with the eyes moving closer together and the ears moving to their normal positions.",
        "momTipText": "As you enter the second trimester, many women begin to feel an energy boost. The nausea and fatigue from the first trimester may start to subside, though some women may still experience symptoms."
    },
    {
        "weekNumber": 14,
        "quote": "I'm currently the size of a peach",
        "imageUri": "https://img.icons8.com/external-icongeek26-linear-colour-icongeek26/64/external-peach-fruits-icongeek26-linear-colour-icongeek26.png",
        "babyImageUri": "Month3",
        "babyHeightInCentimeters": 8.7,
        "babyWeightInGrams": 43,
        "babyTipText": "At this point, your baby is the size of a peach. The baby is developing more muscle and bone tissue, and while the baby still has a lot of growing to do, it's starting to look more like a newborn.",
        "momTipText": "You may notice that your energy levels are up, and your morning sickness continues to fade. Your uterus has grown enough that you might be able to feel it just above your pubic bone."
    },
    {
        "weekNumber": 15,
        "quote": "I'm currently the size of a pear",
        "imageUri": "https://img.icons8.com/cotton/64/pear--v1.png",
        "babyImageUri": "Month3",
        "babyHeightInCentimeters": 10.1,
        "babyWeightInGrams": 70,
        "babyTipText": "Your baby is now about the size of a pear. The baby's bones are becoming more defined and harder, and muscle development is progressing rapidly. The baby is able to make more movements now.",
        "momTipText": "By week 15, many women feel better physically and mentally as the risks of miscarriage decrease and the baby's growth stabilizes. The fatigue and nausea you may have been experiencing are likely subsiding."
    },
    {
        "weekNumber": 16,
        "quote": "I'm currently the size of an avocado",
        "imageUri": "https://img.icons8.com/external-justicon-flat-justicon/64/external-avocado-healthy-food-and-vegan-justicon-flat-justicon.png",
        "babyImageUri": "Month4",
        "babyHeightInCentimeters": 11.6,
        "babyWeightInGrams": 100,
        "babyTipText": "At week 16, your baby is about the size of an avocado. The baby's skeleton is hardening, and muscles are continuing to develop. The baby's face is becoming more recognizable.",
        "momTipText": "Your belly is likely becoming more pronounced as your uterus grows. You may experience changes in your body, such as skin pigmentation, including a dark line running down the center of your abdomen."
    },
    {
        "weekNumber": 17,
        "quote": "I'm currently the size of an orange",
        "imageUri": "https://img.icons8.com/cotton/64/orange--v2.png",
        "babyImageUri": "Month4",
        "babyHeightInCentimeters": 13.0,
        "babyWeightInGrams": 140,
        "babyTipText": "At 17 weeks, your baby is about the size of an orange. The baby is becoming more active, and you might start feeling the first signs of movement, especially if this isn't your first pregnancy.",
        "momTipText": "At 17 weeks, your baby is about the size of an orange. The baby is becoming more active, and you might start feeling the first signs of movement, especially if this isn't your first pregnancy."
    },
    {
        "weekNumber": 18,
        "quote": "I'm currently the size of a sweet potato",
        "imageUri": "https://img.icons8.com/external-goofy-color-kerismaker/96/external-Sweet-Potato-vegetable-goofy-color-kerismaker.png",
        "babyImageUri": "Month4",
        "babyHeightInCentimeters": 14.2,
        "babyWeightInGrams": 190,
        "babyTipText": "At 18 weeks, your baby is about the size of a sweet potato. The baby's sensory systems are maturing, and the baby is developing the ability to hear external sounds. Fine hair (lanugo) is covering the baby's body.",
        "momTipText": "You may feel more energetic as morning sickness continues to subside. Your belly is continuing to grow, and you might be able to feel your uterus above your pelvic bone. Some women notice changes in skin and hair."
    },
    {
        "weekNumber": 19,
        "quote": "I'm currently the size of a mango",
        "imageUri": "https://img.icons8.com/external-vitaliy-gorbachev-flat-vitaly-gorbachev/58/external-mango-fruit-vitaliy-gorbachev-flat-vitaly-gorbachev.png",
        "babyImageUri": "Month4",
        "babyHeightInCentimeters": 15.3,
        "babyWeightInGrams": 240,
        "babyTipText": "At 19 weeks, your baby is about the size of a mango. The baby is becoming more active, and you may begin to feel movements known as \"quickening.\" The baby's muscles are continuing to grow.",
        "momTipText": "Your belly is continuing to grow, and you may feel more pronounced movements from your baby, which is a wonderful milestone in your pregnancy. Hormonal changes are still affecting your skin and hair."
    },
    {
        "weekNumber": 20,
        "quote": "I'm currently the size of a banana",
        "imageUri": "https://img.icons8.com/cotton/64/banana.png",
        "babyImageUri": "Month5",
        "babyHeightInCentimeters": 16.4,
        "babyWeightInGrams": 300,
        "babyTipText": "At 20 weeks, your baby is about the size of a banana. This is the halfway point of your pregnancy! The baby's movements are becoming more noticeable, and you might feel more kicks and rolls.",
        "momTipText": "By week 20, you are officially halfway through your pregnancy, and your belly is growing larger every day. You may notice a more distinct baby bump, and you might be able to feel the baby move more often."
    },
    {
        "weekNumber": 21,
        "quote": "I'm currently the size of a pomegranate",
        "imageUri": "https://img.icons8.com/external-febrian-hidayat-outline-color-febrian-hidayat/64/external-Pomegranate-fruits-febrian-hidayat-outline-color-febrian-hidayat.png",
        "babyImageUri": "Month5",
        "babyHeightInCentimeters": 26.7,
        "babyWeightInGrams": 360,
        "babyTipText": "At 21 weeks, your baby is about the size of a pomegranate. The baby's movements are becoming more noticeable and coordinated, and you may feel kicks, rolls, or even hiccups.",
        "momTipText": "At week 21, you may start to feel more discomfort as your belly grows. You may notice stretch marks appearing as your skin stretches to accommodate your growing baby. Your body is also producing more blood."
    },
    {
        "weekNumber": 22,
        "quote": "I'm currently the size of a papaya",
        "imageUri": "https://img.icons8.com/external-icongeek26-flat-icongeek26/64/external-papaya-fruits-icongeek26-flat-icongeek26.png",
        "babyImageUri": "Month5",
        "babyHeightInCentimeters": 27.8,
        "babyWeightInGrams": 430,
        "babyTipText": "At 22 weeks, your baby is about the size of a papaya. The baby's movements are becoming more noticeable, and you may even begin to see small shifts in the shape of your belly from the baby moving.",
        "momTipText": "As your pregnancy continues, you may notice more frequent trips to the bathroom as your growing uterus presses on your bladder. You may also experience more back pain as your center of gravity shifts."
    },
    {
        "weekNumber": 23,
        "quote": "I'm currently the size of a grapefruit",
        "imageUri": "https://img.icons8.com/external-smashingstocks-flat-smashing-stocks/66/external-Grapefruit-fruit-smashingstocks-flat-smashing-stocks.png",
        "babyImageUri": "Month5",
        "babyHeightInCentimeters": 28.9,
        "babyWeightInGrams": 501,
        "babyTipText": "At 23 weeks, your baby is about the size of a grapefruit. The baby's skin is still thin and wrinkled but is gradually becoming more opaque. Fine hair (lanugo) covers the baby's body.",
        "momTipText": "At week 23, your body is continuing to change as you approach the third trimester. You may be experiencing some physical discomfort, such as back pain, round ligament pain, or swelling in your feet."
    },
    {
        "weekNumber": 24,
        "quote": "I'm currently the size of a cantaloupe",
        "imageUri": "https://img.icons8.com/external-icongeek26-flat-icongeek26/64/external-cantaloupe-fruits-icongeek26-flat-icongeek26.png",
        "babyImageUri": "Month6",
        "babyHeightInCentimeters": 30.0,
        "babyWeightInGrams": 600,
        "babyTipText": "At 24 weeks, your baby is about the size of a cantaloupe. The baby's skin is beginning to look less translucent, although it still has a reddish hue. The baby is growing rapidly.",
        "momTipText": "This week marks the start of the third trimester, and you may feel some relief from the fatigue and nausea of the first trimester, but new discomforts may arise. You may experience Braxton Hicks contractions."
    },
    {
        "weekNumber": 25,
        "quote": "I'm currently the size of a cauliflower",
        "imageUri": "https://img.icons8.com/external-flat-andi-nur-abdillah/64/external-cauliflower-vegetable-and-fruit-flat-flat-andi-nur-abdillah.png",
        "babyImageUri": "Month6",
        "babyHeightInCentimeters": 34.6,
        "babyWeightInGrams": 660,
        "babyTipText": "At 25 weeks, your baby is about the size of a cauliflower. Weighing around 1.5 pounds and measuring over 13 inches long, the baby is beginning to look more like a newborn. The skin is thickening.",
        "momTipText": "Your belly is noticeably bigger now, and your uterus is about the size of a soccer ball. As it pushes upward, you may feel breathless or experience heartburn more frequently. Rest and hydration are important."
    },
    {
        "weekNumber": 26,
        "quote": "I'm currently the size of a lettuce",
        "imageUri": "https://img.icons8.com/external-ddara-lineal-color-ddara/64/external-lettuce-vegetables-ddara-lineal-color-ddara.png",
        "babyImageUri": "Month6",
        "babyHeightInCentimeters": 35.6,
        "babyWeightInGrams": 760,
        "babyTipText": "At 26 weeks, your baby is about the size of a lettuce, measuring nearly 14 inches and weighing about 2 pounds. The baby's eyes, which have been fused shut, are now beginning to open.",
        "momTipText": "By week 26, you're nearing the end of your second trimester. You may be experiencing more pronounced symptoms like swelling in your ankles, feet, or hands, especially at the end of the day."
    },
    {
        "weekNumber": 27,
        "quote": "I'm currently the size of a turnip",
        "imageUri": "https://img.icons8.com/external-goofy-color-kerismaker/96/external-Turnip-vegetable-goofy-color-kerismaker.png",
        "babyImageUri": "Month6",
        "babyHeightInCentimeters": 36.6,
        "babyWeightInGrams": 875,
        "babyTipText": "At 27 weeks, your baby is roughly the size of a head of turnip. Weighing about 2.2 pounds and measuring around 14.5 inches, the baby is growing quickly. The lungs are developing and the brain is maturing.",
        "momTipText": "As you enter the third trimester, you may feel a new wave of physical and emotional changes. The uterus is pressing on internal organs, which can lead to indigestion, constipation, or shortness of breath."
    },
    {
        "weekNumber": 28,
        "quote": "I'm currently the size of an Eggplant",
        "imageUri": "https://img.icons8.com/external-icongeek26-flat-icongeek26/64/external-eggplant-vegan-icongeek26-flat-icongeek26.png",
        "babyImageUri": "Month7",
        "babyHeightInCentimeters": 37.6,
        "babyWeightInGrams": 1005,
        "babyTipText": "At 28 weeks, your baby is about the size of a large eggplant. Weighing nearly 2.5 pounds and measuring around 15 inches, the baby is getting chubbier as fat stores increase, and the skin is less wrinkled.",
        "momTipText": "Entering the third trimester officially, your body continues to transform. You may be gaining weight more rapidly now, and your belly may feel heavy or tight. Common symptoms include leg cramps and insomnia."
    },
    {
        "weekNumber": 29,
        "quote": "I'm currently the size of an acorn squash",
        "imageUri": "https://img.icons8.com/plasticine/100/squash.png",
        "babyImageUri": "Month7",
        "babyHeightInCentimeters": 38.6,
        "babyWeightInGrams": 1153,
        "babyTipText": "At 29 weeks, your baby is about the size of a acorn squash, weighing approximately 2.7 to 3 pounds and measuring over 15 inches long. The brain is developing rapidly, forming grooves and folds.",
        "momTipText": "You may feel physically heavier and more fatigued now, as your belly expands and your baby grows more active. The uterus is pushing up against your diaphragm, possibly making breathing a bit harder."
    },
    {
        "weekNumber": 30,
        "quote": "I'm currently the size of a cabbage",
        "imageUri": "https://img.icons8.com/external-smashingstocks-flat-smashing-stocks/66/external-Cabbage-vegetables-smashingstocks-flat-smashing-stocks-2.png",
        "babyImageUri": "Month7",
        "babyHeightInCentimeters": 39.9,
        "babyWeightInGrams": 1319,
        "babyTipText": "At 30 weeks, your baby is approximately the size of a large cabbage, weighing about 3 pounds and stretching 15.7 inches long. The baby's brain is now controlling body temperature.",
        "momTipText": "As your body supports your growing baby, physical symptoms can intensify. You may experience lower back pain, pelvic pressure, and fatigue. Swelling in your feet and ankles may become more noticeable."
    },
    {
        "weekNumber": 31,
        "quote": "I'm currently the size of a coconut ",
        "imageUri": "https://img.icons8.com/external-goofy-color-kerismaker/96/external-Coconut-fruit-goofy-color-kerismaker.png",
        "babyImageUri": "Month7",
        "babyHeightInCentimeters": 41.1,
        "babyWeightInGrams": 1502,
        "babyTipText": "Your baby is now about the size of a coconut, weighing nearly 3.3 pounds and measuring around 16 inches. The brain and nervous system are maturing quickly, and connections are forming.",
        "momTipText": "By week 31, the physical demands of pregnancy are more pronounced. You may feel more pressure in your pelvis as the baby drops lower, especially if this isn't your first pregnancy."
    },
    {
        "weekNumber": 32,
        "quote": "I'm currently the size of a jicama",
        "imageUri": "https://img.icons8.com/cotton/64/potato--v1.png",
        "babyImageUri": "Month8",
        "babyHeightInCentimeters": 42.4,
        "babyWeightInGrams": 1702,
        "babyTipText": "At 32 weeks, your baby is about the size of a jicama or small pumpkin, weighing close to 3.8 to 4 pounds and measuring about 16.5 to 17 inches long. The baby is getting stronger and more active.",
        "momTipText": "At this point, you may feel increasingly heavy and uncomfortable. Your uterus has expanded to more than 5 inches above your belly button and is pressing on your lungs and stomach."
    },
    {
        "weekNumber": 33,
        "quote": "I'm currently the size of a pomelo",
        "imageUri": "https://img.icons8.com/external-febrian-hidayat-flat-febrian-hidayat/64/external-Pomelo-fruits-febrian-hidayat-flat-febrian-hidayat.png",
        "babyImageUri": "Month8",
        "babyHeightInCentimeters": 43.7,
        "babyWeightInGrams": 1918,
        "babyTipText": "Your baby is now about the size of a pomelo, weighing close to 4.2 to 4.5 pounds (1.9 to 2.1 kg) and measuring around 17 to 17.5 inches (43–44.5 cm) long. Inside the womb, the bones are hardening.",
        "momTipText": "As you move deeper into the third trimester, your body is carrying significant weight. Your uterus has risen well above your belly button, making your center of gravity shift and affecting your posture."
    },
    {
        "weekNumber": 34,
        "quote": "I'm currently the size of a butternut squash",
        "imageUri": "https://img.icons8.com/external-icongeek26-flat-icongeek26/64/external-butternut-squash-fruits-and-vegetables-icongeek26-flat-icongeek26.png",
        "babyImageUri": "Month8",
        "babyHeightInCentimeters": 45.0,
        "babyWeightInGrams": 2146,
        "babyTipText": "At 34 weeks, your baby weighs approximately 4.7 to 5 pounds (2.1 to 2.3 kg) and measures about 17.5 to 18 inches (44.5–45.7 cm) long — around the size of a butternut squash. The baby's lungs are maturing.",
        "momTipText": "By week 34, many moms-to-be feel increasingly tired and physically stretched. The growing belly can cause discomfort in the back and pelvis, and many women begin to waddle due to shifting weight."
    },
    {
        "weekNumber": 35,
        "quote": "I'm currently the size of a pineapple",
        "imageUri": "https://img.icons8.com/external-smashingstocks-flat-smashing-stocks/66/external-Pineapple-food-smashingstocks-flat-smashing-stocks.png",
        "babyImageUri": "Month8",
        "babyHeightInCentimeters": 46.2,
        "babyWeightInGrams": 2383,
        "babyTipText": "Your baby now weighs about 5.3 to 5.5 pounds (2.4 to 2.5 kg) and measures roughly 18 to 18.5 inches (45.7–47 cm) long — comparable to a pineapple. At this stage, the baby's kidneys and liver are mature.",
        "momTipText": "You might feel like you're nearing the finish line — but the final few weeks can feel physically taxing. Your uterus is now crowding your other organs, making heartburn, indigestion, and shortness of breath common."
    },
    {
        "weekNumber": 36,
        "quote": "I'm currently the size of a honeydew",
        "imageUri": "https://img.icons8.com/external-others-iconmarket/64/external-cantaloupe-fruit-and-veggies-others-iconmarket-2.png",
        "babyImageUri": "Month9",
        "babyHeightInCentimeters": 47.4,
        "babyWeightInGrams": 2622,
        "babyTipText": "At 36 weeks, your baby is about the size of a honeydew or small watermelon, weighing around 5.8 to 6 pounds (2.6 to 2.7 kg) and measuring about 18.5 to 19 inches (47–48.3 cm) long. The baby's immune system is developing.",
        "momTipText": "This week marks the beginning of your ninth month, and your body is likely feeling more ready for birth than ever. You may notice that your bump has shifted lower, relieving pressure on your lungs but increasing pressure in the pelvis."
    },
    {
        "weekNumber": 37,
        "quote": "I'm currently the size of a small jackfruit",
        "imageUri": "https://img.icons8.com/external-icongeek26-flat-icongeek26/64/external-jackfruit-fruits-and-vegetables-icongeek26-flat-icongeek26.png",
        "babyImageUri": "Month9",
        "babyHeightInCentimeters": 48.6,
        "babyWeightInGrams": 2859,
        "babyTipText": "Your baby is now considered early term, meaning most major organs are mature enough to function independently outside the womb. Your little one weighs about 6.2 to 6.5 pounds (2.8 to 2.9 kg) and is about 19 inches (48 cm) long.",
        "momTipText": "At week 37, you're officially in the home stretch. Your body is preparing in many visible and invisible ways. You might feel increased pelvic pressure or heaviness as the baby moves downward in preparation for birth."
    },
    {
        "weekNumber": 38,
        "quote": "I'm currently the size of a Swiss chard",
        "imageUri": "https://img.icons8.com/external-goofy-flat-kerismaker/96/external-Chard-vegetable-goofy-flat-kerismaker.png",
        "babyImageUri": "Month9",
        "babyHeightInCentimeters": 49.8,
        "babyWeightInGrams": 3083,
        "babyTipText": "Your baby is now about the size of a Swiss chard, weighing 6.8 to 7 pounds (3.1 to 3.2 kg) and measuring around 19.5 to 20 inches (49.5–50.8 cm). At this point, all of the baby's organs are mature.",
        "momTipText": "You may feel like you're on high alert now, watching for every cramp or twinge and wondering if it's the start of labor. Your belly is stretched to its maximum size, and simple tasks may feel exhausting."
    },
    {
        "weekNumber": 39,
        "quote": "I'm currently the size of a small pumpkin",
        "imageUri": "https://img.icons8.com/external-flaticons-flat-flat-icons/64/external-pumpkin-gardening-flaticons-flat-flat-icons.png",
        "babyImageUri": "Month9",
        "babyHeightInCentimeters": 50.7,
        "babyWeightInGrams": 3288,
        "babyTipText": "Your baby is considered full term, weighing around 7.2 to 7.6 pounds (3.3 to 3.4 kg) and measuring 20 to 20.5 inches (50.8–52 cm) long — about the size of a mini pumpkin. The baby's lungs are fully developed.",
        "momTipText": "Your body is in final preparation mode, and it can feel like an emotional roller coaster. You might feel ready one moment and nervous the next. Many women feel intense pelvic pressure or frequent urination."
    },
    {
        "weekNumber": 40,
        "quote": "I'm currently the size of a watermelon",
        "imageUri": "https://img.icons8.com/external-flat-gradient-andi-nur-abdillah/64/external-watermelon-vegetable-and-fruit-flat-gradient-flat-gradient-andi-nur-abdillah.png",
        "babyImageUri": "Month9",
        "babyHeightInCentimeters": 51.2,
        "babyWeightInGrams": 3462,
        "babyTipText": "You've reached the official due date, though many babies arrive a little before or after. Your baby weighs about 7.5 to 8 pounds (3.4 to 3.6 kg) and is around 20.5 to 21 inches long. The baby is ready for birth.",
        "momTipText": "You've made it to the final week! At this point, you might feel extremely impatient, uncomfortable, and exhausted. Every movement may feel like a chore, and you may be feeling anxious or excited for labor to begin."
    }
]